In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\prerna ranjan\appdata\local\programs\python\python311\lib\site-packages (2.1.1)
Requirement already satisfied: numpy>=1.23.2 in c:\users\prerna ranjan\appdata\local\programs\python\python311\lib\site-packages (from pandas) (1.26.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\prerna ranjan\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\prerna ranjan\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\prerna ranjan\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\prerna ranjan\appdata\local\programs\python\python311\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 23.2.1 -> 24.0
[notice] To update, run: python.exe -m pip install --upgrade pip

In [6]:
import pandas as pd

In [4]:
x = ["Prerna","Yash","Pragati","Harry","John","Ron","George"]
print(x)

['Prerna', 'Yash', 'Pragati', 'Harry', 'John', 'Ron', 'George']

In [7]:
Data=pd.DataFrame(x) #Converting list into Data with DataFrame function
Data
#Colume Index starts with 0 and even row index also starts with 0 in DF

         0
0   Prerna
1     Yash
2  Pragati
3    Harry
4     John
5      Ron
6   George

In [8]:
#Creating data from  dictionary

dict1={"Name":["Satvika","Payal","Mohan","Harry","Jinal","Leena","Pratik","saki"],
      "Age":[29,25,27,21,26,28,22,20],
       "City": ["Mumbai","Palghar","Thane","Chennai","Pune","Hyderabad",'Mumbai',"Pune"]}
print(dict1)

{'Name': ['Satvika', 'Payal', 'Mohan', 'Harry', 'Jinal', 'Leena', 'Pratik', 'saki'], 'Age': [29, 25, 27, 21, 26, 28, 22, 20], 'City': ['Mumbai', 'Palghar', 'Thane', 'Chennai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune']}

In [9]:
Student=pd.DataFrame(dict1)
Student

      Name  Age       City
0  Satvika   29     Mumbai
1    Payal   25    Palghar
2    Mohan   27      Thane
3    Harry   21    Chennai
4    Jinal   26       Pune
5    Leena   28  Hyderabad
6   Pratik   22     Mumbai
7     saki   20       Pune

In [10]:
#To access a column 

Student["Name"]

0    Satvika
1      Payal
2      Mohan
3      Harry
4      Jinal
5      Leena
6     Pratik
7       saki
Name: Name, dtype: object

In [11]:
#To access multiple column 
Student[["Name","City"]] #When we want more than 1 column we have to write column headers in 2D array

      Name       City
0  Satvika     Mumbai
1    Payal    Palghar
2    Mohan      Thane
3    Harry    Chennai
4    Jinal       Pune
5    Leena  Hyderabad
6   Pratik     Mumbai
7     saki       Pune